[
  {
    "name": "Understanding gRPC, OpenAPI and REST and when to use them ...",
    "snippet": "OpenAPI calls the variables in these paths \"parameters\" and the combination of a path and an HTTP method is called an operation—similar terminology to RPC systems. OpenAPI's use of URL templates with parameters can be viewed as a way to express RPC-like concepts with custom mappings to HTTP. OpenAPI advantages and disadvantages",
    "url": "https://cloud.google.com/blog/products/api-management/understanding-grpc-openapi-and-rest-and-when-to-use-them",
    "domain": "cloud.google.com"
  },
  {
    "name": "OpenAPI Specification: Product Attributes API",
    "snippet": "OpenAPI Specification: Product Attributes API",
    "url": "https://developers.merchants.zalando.com/docs/openapi/product-attributes.html",
    "domain": "developers.merchants.zalando.com"
  },
  {
    "name": "OpenAPI Specification 3.1.0 Released",
    "snippet": "SAN FRANCISCO, Feb. 18, 2021 /PRNewswire/ -- The OpenAPI Initiative, the consortium of forward-looking industry experts focused on creating, evolving and promoting the OpenAPI Specification (OAS ...",
    "url": "https://www.prnewswire.com/news-releases/openapi-specification-3-1-0-released-301231096.html",
    "domain": "prnewswire.com"
  },
  {
    "name": "OpenAPI Specification - Version 3.0.3 | Swagger",
    "snippet": "For example, a valid OpenAPI 3.0.2 document, upon changing its openapi property to 3.1.0, SHALL be a valid OpenAPI 3.1.0 document, semantically equivalent to the original OpenAPI 3.0.2 document. New minor versions of the OpenAPI Specification MUST be written to ensure this form of backward compatibility.",
    "url": "https://swagger.io/specification/",
    "domain": "swagger.io"
  },
  {
    "name": "Develop ASP.NET Core apps using OpenAPI | Microsoft Docs",
    "snippet": "Adding an OpenAPI reference using any of the commands on this page adds an <OpenApiReference /> element similar to the following to the .csproj file: <OpenApiReference Include=\"openapi.json\" /> The preceding reference is required for the app to call the generated client code.",
    "url": "https://docs.microsoft.com/en-us/aspnet/core/web-api/Microsoft.dotnet-openapi",
    "domain": "docs.microsoft.com"
  },
  {
    "name": "Working with OpenAPI definitions for HTTP APIs - Amazon ...",
    "snippet": "You can define your HTTP API by using an OpenAPI 3.0 definition file. Then you can import the definition into API Gateway to create an API. To learn more about API Gateway extensions to OpenAPI, see Working with API Gateway extensions to OpenAPI. Importing an HTTP API. You can create an HTTP API by importing an OpenAPI 3.0 definition file. ...",
    "url": "https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-open-api.html",
    "domain": "docs.aws.amazon.com"
  },
  {
    "name": "OpenAPI Specification - Wikipedia",
    "snippet": "The OpenAPI Specification, originally known as the Swagger Specification, is a specification for machine-readable interface files for describing, producing, consuming, and visualizing RESTful web services. Originally part of the Swagger framework, it became a separate project in 2016, overseen by the OpenAPI Initiative, an open-source collaboration project of the Linux Foundation.",
    "url": "https://en.wikipedia.org/wiki/OpenAPI_Specification",
    "domain": "en.wikipedia.org"
  },
  {
    "name": "OpenAPI Specification: How to Use Postman and OpenAPI",
    "snippet": "Reading Time: 3 minutes This is a follow-up to our recent post about Postman joining the OpenAPI Initiative (OAI).You can read the full announcement here.. At Postman, our mission is to encourage creativity by providing user-friendly tools that help people create innovative software.",
    "url": "https://blog.postman.com/openapi-specification-postman-how-to/",
    "domain": "blog.postman.com"
  },
  {
    "name": "Open API vz REST API - difference - Stack Overflow",
    "snippet": "The OpenAPI Specification (OAS) defines a standard, programming language-agnostic interface description for REST APIs, which allows both humans and computers to discover and understand the capabilities of a service without requiring access to source code, additional documentation, or inspection of network traffic.",
    "url": "https://stackoverflow.com/questions/48123867/open-api-vz-rest-api-difference",
    "domain": "stackoverflow.com"
  },
  {
    "name": "swagger - What does 'required' in OpenAPI really mean ...",
    "snippet": "The required keyword in OpenAPI has the same meaning as in JSON Schema:. required. An object instance is valid against this keyword if its property set contains all elements in this keyword's array value. The wording in the latest JSON Schema spec (although it's not the one used by OpenAPI) is more clear:. An object instance is valid against this keyword if every item in the array is the name ...",
    "url": "https://stackoverflow.com/questions/45575493/what-does-required-in-openapi-really-mean",
    "domain": "stackoverflow.com"
  },
  {
    "name": "What Is the Difference Between Swagger and OpenAPI?",
    "snippet": "The OpenAPI is the official name of the specification. The development of the specification is fostered by the OpenAPI Initiative, which involves more the 30 organizations from different areas of the tech world — including Microsoft, Google, IBM, and CapitalOne.",
    "url": "https://smartbear.com/blog/what-is-the-difference-between-swagger-and-openapi/",
    "domain": "smartbear.com"
  },
  {
    "name": "Azure API Management overview and key concepts | Microsoft ...",
    "snippet": "Products can be Open or Protected. Protected products must be subscribed to before they can be used, while open products can be used without a subscription. When a product is ready for use by developers, it can be published. Once it is published, it can be viewed (and in the case of protected products subscribed to) by developers.",
    "url": "https://docs.microsoft.com/en-us/azure/api-management/api-management-key-concepts",
    "domain": "docs.microsoft.com"
  },
  {
    "name": "OpenAPI Editor | Eclipse Plugins, Bundles and Products ...",
    "snippet": "OpenAPI editor by Remain API Studio. A rich OpenAPI editor and a full OAS3 specs-compliant development environment. This rich OpenAPI editor enables you to create, edit, delete and update OpenAPI schemas, paths, security, servers, examples, tags, and all other components as defined by the OAS3 specs.",
    "url": "https://marketplace.eclipse.org/content/openapi-editor",
    "domain": "marketplace.eclipse.org"
  },
  {
    "name": "Your Guide To OpenAPI | Nordic APIs",
    "snippet": "OpenAPI opens the doorway to non-developers and less technically proficient people to use and consume APIs. This will likely usher in a new age of data-driven apps, tools, products, and resources. Benefits Of OpenAPI",
    "url": "https://nordicapis.com/your-guide-to-openapi/",
    "domain": "nordicapis.com"
  },
  {
    "name": "OpenAPI and gRPC Side-by-Side. Spend some time working ...",
    "snippet": "The biggest OpenAPI code generation project is called swagger-codegen, but there are several other code generators available including AutoRest by Microsoft, a project from Capital One called oas ...",
    "url": "https://medium.com/apis-and-digital-transformation/openapi-and-grpc-side-by-side-b6afb08f75ed",
    "domain": "medium.com"
  },
  {
    "name": "OpenAPI Specification: Products API - Zalando",
    "snippet": "OpenAPI Specification: Products API - Zalando",
    "url": "https://developers.merchants.zalando.com/docs/openapi/products.html",
    "domain": "developers.merchants.zalando.com"
  },
  {
    "name": "OpenAPI Explorer",
    "snippet": "Products. Recent visit Elastic Compute Service Virtual Private Cloud Resource Access Management Cloud Monitor ApsaraDB for RDS Server Load Balancer. ... Searching, Online Debugging OpenAPI, Online Cli Tool, Automatically generate SDK code example. Recent visit. Cloud Monitor. Resource Access Management. ApsaraDB for RDS. Server Load Balancer.",
    "url": "https://api.alibabacloud.com/",
    "domain": "api.alibabacloud.com"
  },
  {
    "name": "Generating HTTP API clients using Visual Studio Connected ...",
    "snippet": "We’re continuing our series on building HTTP APIs with .NET 5. In the first post in this series we talked about building well-described APIs using OpenAPI, and then followed that up taking a deeper dive into some of the open-source tools and packages you can use to make your HTTP API development easier.",
    "url": "https://devblogs.microsoft.com/aspnet/generating-http-api-clients-using-visual-studio-connected-services/",
    "domain": "devblogs.microsoft.com"
  },
  {
    "name": "KaiZen OpenAPI Editor - Eclipse Plugins, Bundles and Products",
    "snippet": "Swagger-OpenAPI Zen In Your Eclipse IDE KaiZen OpenAPI Editor is RepreZen's open source, Eclipse-based editor for the industry-standard OpenAPI Specification language, based on Swagger. This is the same full-featured editor that powers Swagger-OpenAPI in the popular RepreZen API Studio solution. Features Include:",
    "url": "https://marketplace.eclipse.org/content/kaizen-openapi-editor",
    "domain": "marketplace.eclipse.org"
  },
  {
    "name": "Understanding OpenAPI Fields - Saxo Bank Developer Portal",
    "snippet": "OpenAPIGet functions require instructions on which FieldGroups and Fields to returned in Excel/VBA, the later of which is encoded in the \"Fields\" argument:. This list is a simple case-sensitive, comma-separated string with full stops identifying nested sub-elements. The FieldGroups query string parameter controls which data structures are returned in the response body.",
    "url": "https://www.developer.saxo/excel/user-guide/understanding-openapi-fields",
    "domain": "developer.saxo"
  },
  {
    "name": "Products APIs_OpenAPI_Developers-Huawei Cloud",
    "snippet": "Products with Open APIs. Currently, open APIs are only available for the following products. More APIs will be available in the following days. For details about available regions and service endpoints of HUAWEI CLOUD, see Regions and Endpoints . Regions and Endpoints. Compute ...",
    "url": "https://developer.huaweicloud.com/en-us/openapilist",
    "domain": "developer.huaweicloud.com"
  },
  {
    "name": "Saxo Bank Developer Portal",
    "snippet": "The main resource for documentation, guides, tutorials, and tools for Saxo Bank's OpenAPI platform products and services. Get started New users of the platform are advised to review the High-Level Overview and create a account on the portal to use the various Online Tools .",
    "url": "https://www.developer.saxo/openapi/learn",
    "domain": "developer.saxo"
  },
  {
    "name": "Getting Started with OpenAPI for Excel | Saxo Group",
    "snippet": "OpenAPI is the gateway to Saxo Banks IT infrastructure. The API allows clients and partners to build customized trading applications that communicate directly with Saxo Banks trading systems. All of Saxo Bank’s next generation trading platforms are built on top of the OpenAPI. OpenAPI for Excel exposes all the power of OpenAPI directly in Excel.",
    "url": "https://www.home.saxo/campaigns/trading-for-excel/getting-started",
    "domain": "home.saxo"
  },
  {
    "name": "An adventure in OpenAPI V3 code generation | Mux blog",
    "snippet": "Improve our development workflow and start from OpenAPI definitions, and generate API stubs before building products; Summary. OpenAPI is a great standard for modeling your APIs, and the tooling to generate your SDKs from it works well across a variety of languages. However this is still an evolving space - you can’t expect everything to work ...",
    "url": "https://mux.com/blog/an-adventure-in-openapi-v3-api-code-generation/",
    "domain": "mux.com"
  },
  {
    "name": "OpenAPI-Specification/IMPLEMENTATIONS.md at master · OAI ...",
    "snippet": "Implementations. Below is a list of known tooling that implements the 3.0.0 specification. While support for the 3.0.0 specification matures, refer to the details of projects listed below for any notes about stability and roadmap.",
    "url": "https://github.com/OAI/OpenAPI-Specification/blob/master/IMPLEMENTATIONS.md",
    "domain": "github.com"
  },
  {
    "name": "REST API to OpenApi to GraphQL. The journey from ...",
    "snippet": "Document the entire API with OpenAPI and use GraphQL Mesh OpenApi handler to map it to a GraphQL Schema; ... (which is very important when choosing open source for you high-scale production products).",
    "url": "https://medium.com/everything-full-stack/rest-api-to-openapi-to-graphql-924fe11a3c7d",
    "domain": "medium.com"
  },
  {
    "name": "Using the OpenAPI discriminator · Redocly",
    "snippet": "OpenAPI-generated documentation tool with 11,000+ stars on Github - for API docs you can be proud of. Products Reference docs Easily create, style, and manage your API documentation",
    "url": "https://redoc.ly/docs/resources/discriminator/",
    "domain": "redoc.ly"
  },
  {
    "name": "UML to OpenAPI Mapping Guidelines",
    "snippet": "Mapping Guidelines UML !OpenAPI Version 1.0 Page 6 of 34 ONF In this document, UML-OpenAPI (RESTful API with JSON Schema) mapping guidelines will be specified. 5 UML- OpenAPI Mapping Guidelines The UML- OpenAPI mapping rules are defined in table format and are structured based on the UML artifacts defined in [1].",
    "url": "https://opennetworking.org/wp-content/uploads/2018/02/TR-543-v1.0-info.pdf",
    "domain": "opennetworking.org"
  },
  {
    "name": "Exporting APIs | ReadyAPI Documentation",
    "snippet": "The format of the created API: Swagger 2.0 or OpenAPI 3.0. Remember credentials: Select if you want to save the entered credentials for future exports. Private: Select if you want to make the API private.",
    "url": "https://support.smartbear.com/readyapi/docs/apis/export.html",
    "domain": "support.smartbear.com"
  },
  {
    "name": "Documenting an ASP.NET Core API with OpenAPI / Swagger ...",
    "snippet": "OpenAPI Specification, originally known as the Swagger Specification. Both terms are interchangeable, but OpenAPI is the preferred term. Once you start surfing around for information on OpenAPI or Swagger, you will quickly encounter terms like Swagger UI, Swashbuckle, NSwag, and so on.",
    "url": "https://www.codeproject.com/Articles/5270416/Documenting-an-ASP-NET-Core-API-with-OpenAPI-Swagg",
    "domain": "codeproject.com"
  },
  {
    "name": "API Documentation & Design Tools for Teams | Swagger",
    "snippet": "The power of Swagger tools starts with the OpenAPI Specification — the industry standard for RESTful API design. Explore OAS. Open Source Tools. Individual tools to create, update and share OpenAPI definitions with consumers ... Thousands of teams worldwide trust Swagger to deliver better products, faster. Swagger for Everyone",
    "url": "https://swagger.io/",
    "domain": "swagger.io"
  },
  {
    "name": "Benefits of Using the OpenAPI (Swagger) Specification for ...",
    "snippet": "The OpenAPI specification was known as Swagger until version 3.0 was released in 2017, when it was renamed to OpenAPI. It’s a language agnostic way to describe a RESTful API, that can be used to ...",
    "url": "https://dzone.com/articles/benefits-of-using-the-openapi-swagger-specificatio",
    "domain": "dzone.com"
  },
  {
    "name": "API Description Languages podcast with Kin Lane",
    "snippet": "So OpenAPI describes the path for the products API. All the parameters, all the details. And then it has a reference to JSON Schema that says, \"Here's the product you'll get back as part of the response,\" or \"Here's the product you can send as part of the request. And so JSON Schema is a subset of OpenAPI.",
    "url": "https://www.torocloud.com/podcast/api-description-languages-kin-lane",
    "domain": "torocloud.com"
  },
  {
    "name": "Benefits of using the OpenAPI (Swagger) specification for ...",
    "snippet": "OpenAPI is the REST specification with the most languages supported by their code-generators. It generates server stubs in the language of our choice, and we have to wire it up with our backend services and databases. Tooling. The Swagger specification got donated to the OpenAPI foundation and renamed to OpenAPI specification.",
    "url": "https://www.moesif.com/blog/technical/api-design/Benefits-of-using-the-OpenAPI-Swagger-specification-for-your-API/",
    "domain": "moesif.com"
  },
  {
    "name": "Using JSON references ($refs) - Redocly",
    "snippet": "OpenAPI-generated documentation tool with 11,000+ stars on Github - for API docs you can be proud of. Products Reference docs Easily create, style, and manage your API documentation",
    "url": "https://redoc.ly/docs/resources/ref-guide/",
    "domain": "redoc.ly"
  },
  {
    "name": "Open-source HTTP API packages and tools | ASP.NET Blog",
    "snippet": "A dependency of most of the OpenAPI-supporting projects in the .NET and Azure community, this package is responsible for a variety of features: Translating between versions of Swagger and OpenAPI, YAML, or JSON flavors. Provides a single shared object model in .NET for OpenAPI descriptions. Reading and writing OpenAPI descriptions.",
    "url": "https://devblogs.microsoft.com/aspnet/open-source-http-api-packages-and-tools/",
    "domain": "devblogs.microsoft.com"
  },
  {
    "name": "Using OpenAPI with .NET Core - Red Hat Developer",
    "snippet": "Build the web service. In this section, we’ll use the open source Swashbuckle.AspNetCore package to provide an OpenAPI description of an ASP.NET Core application.. We start by creating a webapi template application: $ dotnet new webapi -o WebApi1 $ cd WebApi1 The webapi template includes a REST API to get a weather forecast. The API is implemented in the WeatherForecastController.cs file.",
    "url": "https://developers.redhat.com/blog/2020/09/16/using-openapi-with-net-core/",
    "domain": "developers.redhat.com"
  },
  {
    "name": "Vonage Joins OpenAPI Initiative - PR Newswire",
    "snippet": "About the OpenAPI Initiative The OpenAPI Initiative (OAI) was created by a consortium of forward-looking industry experts who recognize the immense value of standardizing on how APIs are described.",
    "url": "https://www.prnewswire.com/news-releases/vonage-joins-openapi-initiative-301224280.html",
    "domain": "prnewswire.com"
  },
  {
    "name": "AsyncAPI vs OpenAPI: What's The Difference? | Nordic APIs",
    "snippet": "OpenAPI Specification, known formerly as the Swagger, is a solution that produces machine-readable documentation for REST APIs.Initially developed in 2010, Swagger was later acquired in 2015 by SmartBear Software. As Swagger was developed and expanded, the Open API Initiative was launched to further develop and promote the Swagger toolset in an open format, supported by major industry players ...",
    "url": "https://nordicapis.com/asyncapi-vs-openapi-whats-the-difference/",
    "domain": "nordicapis.com"
  },
  {
    "name": "GitHub - dzuluaga/datamodel-to-openapi: Data model to ...",
    "snippet": "datamodel-to-openapi framework intends to solve DRY (don't repeat yourself) principle that many teams face when designing and building *data-oriented APIs. In my experience, every time API teams decide to expose a new resource, and it needs to debate over and over again the same design process.",
    "url": "https://github.com/dzuluaga/datamodel-to-openapi",
    "domain": "github.com"
  },
  {
    "name": "Working with REST APIs in WebStorm | The WebStorm Blog",
    "snippet": "One is integration with the OpenAPI Code Generator, which you can use to create a library based on the API spec. The other is a Compare with Last Specification Revision action, which you can invoke from the Find Action popup (Cmd/Ctrl+Shift+A) and use to find any breaking changes introduced in the OpenAPI spec in your project. The WebStorm team",
    "url": "https://blog.jetbrains.com/webstorm/2020/08/working-with-rest-apis-in-webstorm/",
    "domain": "blog.jetbrains.com"
  },
  {
    "name": "Download our Healthcare Messaging App | TigerText ...",
    "snippet": "Download our Healthcare Messaging App TigerConnect's healthcare messaging app allows you to take advantage of unprecedented cost savings, improved clinician morale and better health outcomes.",
    "url": "https://tigerconnect.com/products/download/",
    "domain": "tigerconnect.com"
  },
  {
    "name": "Getting started | Swagger-PHP v3.x - GitHub Pages",
    "snippet": "openapi: 3.0.0 paths: /products: get: summary: \"list products\" responses: \"200\": description: \"A list with products\" default: description: 'an \"unexpected\" error' # Detects values based on context swagger-php looks at the context of the comment which reduces duplication.",
    "url": "http://zircote.github.io/swagger-php/Getting-started.html",
    "domain": "zircote.github.io"
  },
  {
    "name": "OpenAPI Solutions at TORO Cloud",
    "snippet": "OpenAPI schemas are automatically generated in native JSON and YAML file formats by the API designer. Distributing an OpenAPI schema to consumers of your API will make it more discoverable and easier to consume as machine generated services can be generated from it.",
    "url": "https://www.torocloud.com/solutions/openapi",
    "domain": "torocloud.com"
  },
  {
    "name": "Band Protocol Becomes First Blockchain Project to Join ...",
    "snippet": "Band Protocol has become first blockchain firm to join the OpenAPI Initiative alongside big names such as Google, eBay, IBM and Microsoft.",
    "url": "https://www.coindesk.com/band-protocol-becomes-first-blockchain-project-to-join-openapi-initiative",
    "domain": "coindesk.com"
  },
  {
    "name": "OpenAPI v3 support in Azure API Management is now ...",
    "snippet": "OpenAPI Specification v3 support in Azure API Management is now generally available. OpenAPI Specification v3 is the latest major version of the broadly used, open-source, programming language-agnostic interface description for REST APIs.Microsoft's work is based on the OpenAPI.NET SDK project.. This version includes fixes and improvements to the preview functionality—for example, it enables ...",
    "url": "https://azure.microsoft.com/en-us/updates/openapi-v3-support-in-azure-api-management-is-now-generally-available/",
    "domain": "azure.microsoft.com"
  },
  {
    "name": "About Us - Intsig",
    "snippet": "Products: standalone SDK, OpenAPI, REST API. Learn more. Document Recognition Detects the edges of image and removes the surplus background automatically, corrects tilt and provides 5 kinds of image enhancement models, empowers your system and application with more possibilities.",
    "url": "https://en.intsig.com/about",
    "domain": "en.intsig.com"
  },
  {
    "name": "Vonage Joins OpenAPI Initiative | Markets Insider",
    "snippet": "About the OpenAPI Initiative The OpenAPI Initiative (OAI) was created by a consortium of forward-looking industry experts who recognize the immense value of standardizing on how APIs are described.",
    "url": "https://markets.businessinsider.com/news/stocks/vonage-joins-openapi-initiative-1030060538",
    "domain": "markets.businessinsider.com"
  },
  {
    "name": "Products APIs_OpenAPI_Developers-Huawei Cloud",
    "snippet": "Products with Open APIs. Currently, open APIs are only available for the following products. More APIs will be available in the following days. For details about available regions and service endpoints of HUAWEI CLOUD, see Regions and Endpoints. Regions and Endpoints. Compute.",
    "url": "https://developer.huaweicloud.com/intl/en-us/openapilist",
    "domain": "developer.huaweicloud.com"
  },
  {
    "name": "openapi - convert C# object to IOpenApiAny - Stack Overflow",
    "snippet": "OpenAPI is the \"new\" (2-year old already) name for Swagger anyway, so Swashbuckle already supports it, even if the names are different – Panagiotis Kanavos Dec 6 '19 at 11:26 1 Please post your code.",
    "url": "https://stackoverflow.com/questions/59205532/convert-c-sharp-object-to-iopenapiany",
    "domain": "stackoverflow.com"
  },
  {
    "name": "Getting started | Swagger-PHP v3.x",
    "snippet": "openapi: 3.0.0 paths: /products: get: summary: \"list products\" responses: \"200\": description: \"A list with products\" default: description: 'an \"unexpected\" error' # Detects values based on context swagger-php looks at the context of the comment which reduces duplication.",
    "url": "https://zircote.github.io/swagger-php/Getting-started.html",
    "domain": "zircote.github.io"
  },
  {
    "name": "Generate a new function app from an OpenAPI specification ...",
    "snippet": "You can now generate function apps by importing an OpenAPI specification via the Azure Functions VS Code extension or command line. This new capability automatically generates all the necessary functions for your API, preconfigured based on the OpenAPI specification. Once generated, you add the business logic to each function/route as necessary.",
    "url": "https://azure.microsoft.com/en-us/updates/generate-a-new-function-app-from-an-openapi-specification/",
    "domain": "azure.microsoft.com"
  }
]